Revit 2027 API
BuiltInFailures.EditingFailures.ElementsDeletedPastedToKeep Property
 Elements were deleted. Use Edit Pasted Elements to keep them.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsDeletedPastedToKeep { get; }
Public Shared ReadOnly Property ElementsDeletedPastedToKeep As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsDeletedPastedToKeep {
	FailureDefinitionId^ get ();
}
static member ElementsDeletedPastedToKeep : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace